Repository: Jorixon/JASM
Catalog: src/GIMI-ModManager.WinUI/Strings/*/Settings.resw
Source language: en_us
Languages: ru_ru, zh_cn

# 3dmigotoFolderSelector.Title
source: 3Dmigoto Folder
ru_ru: Папка 3dMigoto
zh_cn: 3dMigoto 文件夹选择器

# ChangeLanguageDialogText
source: Changing the language requires a restart of the application. This is required to properly configure the application for the selected language. Do you want to change the language?
ru_ru: Изменение языка требует перезапуска приложения. Это необходимо для корректной настройки приложения для выбранного языка. Хотите изменить язык?
zh_cn: 更改语言需要重新启动应用程序。 这是为了正确配置应用程序以适应所选语言。 是否要更改语言？

# FolderSectionHeader.Text
source: Folders
ru_ru: Папки
zh_cn: 文件夹

# GameSelectorComboBox.Header
source: Selected Game:
ru_ru: Выберите Игру:
zh_cn: 选择游戏：

# GameSelectorSectionHeader.Text
source: Game
ru_ru: Игра
zh_cn: 游戏

# GameSelectorTitle.Text
source: JASM fully supports Genshin Impact and Honkai Star Rail. JASM partially supports WUWA and ZZZ
ru_ru: JASM поддерживает Genshin Impact и Honkai Star Rail
zh_cn: JASM 支持原神和崩坏星铁道

# LanguageSelectionSectionHeader.Text
source: Language
ru_ru: Язык
zh_cn: 语言

# LanguageSelectorComboBox.Header
source: Select Display Language:
ru_ru: Выберите язык отображения:
zh_cn: 选择显示语言：

# LanguageSelectorTitle.Text
source: Language options are currently limited. It is a work in progress.
ru_ru: Опции языка в данный момент ограничены. Работа над ними продолжается.
zh_cn: 目前语言选项有限。我们正在继续改进。

# ModsFolderSelector.Title
source: Mods Folder
ru_ru: Папка модов
zh_cn: 修改文件夹

# ModUpdateCheckerCheckBox.Content
source: Mod Auto Update Checker:
ru_ru: Автоматическая проверка модов
zh_cn: 自动检查修改更新

# ModUpdateCheckerDescription.Text
source: The Mod Update Checker checks for mod updates on startup and periodically in the background, only support for GameBanana. Does a check every 2 hours when enabled, however, it only checks mods that have not been checked in at least 1 hour. Manually checking for updates always checks GameBanana directly
ru_ru: Mod Update Checker проверяет наличие обновлений модов при запуске и периодически в фоновом режиме. При включении проверяет каждые 30 минут, однако проверяет только те моды, которые не проверялись по крайней мере 15 минут. Ручная проверка обновлений всегда проверяет GameBanana напрямую.
zh_cn: 修改更新检查器会在启动时和后台定期检查修改的更新。 启用后每30分钟检查一次，但只检查至少15分钟未检查的修改。 手动检查总是直接检查 GameBanana。

# ModUpdateCheckerNextText.Text
source: Next Check at:
ru_ru: Следующая проверка в:
zh_cn: 下次检查时间：

# ModUpdateCheckerSectionHeader.Text
source: Mod Update Checker
ru_ru: Проверка обновлений у модов
zh_cn: 修改更新检查
